var typeArr = ["Человек","Гном","Эльф","Орк","Хоббит","Гоблин","Животное","Пришелец","Зомби","Приведение","Робот","Дриада"]

var genderArr = ["Мужчина", "Женщина"]

var ageArr = ["Молодой", "Взрослый", "Старый"]

var temperArr = ["Добрый", "Злой"]

var professionArr = ["Академик","Исследователь","Советник","Дрессировщик","Лучник","Оружейник","Ассасин","Пекарь","Цирюльник","Бард","Владелец таверны","Кузнец","Мечевщик","Телохранитель","Книжный переплетчик","Охотник за головами","Пивовар","Мясник","Плотник","Гонщик на колесницах","Сыродел","Городской стражник","Повар","Бондарь","Дантист","Детектив","Дипломат","Портной","Красильщик","Кузнец по подковам","Рыбак","Цветочник","Лакей","Садовник","Гладиатор","Стеклодув","Шляпник","Целитель","Изобретатель","Шут","Ювелир","Камеристка","Слесарь","Лесоруб","Картограф","Купец","Горнорабочий","Музыкант","Некромант","Священник","Няня","Художник","Пират","Зельевар","Гончар","Тюремщик","Пророк","Проститутка","Моряк","Скульптор","Слуга","Корабельщик","Сапожник","Владелец лавки","Раб","Контрабандист","Солдат","Шпион","Конюх","Каменщик","Хирург","Кондитер","Кожевник","Сборщик налогов","Изготовитель духов","Кровельщик","Вор","Кукольник","Охотник","Волшебник","Палач","Аптекарь","Коробейник","Погонщик скота","Странствующие актеры","Бродяга","Король","Археолог","Дизайнер","Градостроитель","Программист","Реставратор","Психолог","Космонавт","Режиссер","Судья","Военный лётчик","Пилот","Спасатель","Кинолог","Журналист","Фотограф","Полицейский","Частный детектив","Писатель","Учитель математики","Стилист","Бариста","Ювелир","Флорист","Диджей","Философ","Хранитель","Пожарный","Картограф","Плотник","Швея","Уборщик","Мойщик","Ключник","Часовщик","Электрик","Санта Клаус","Механик","Охотник","Стюардесса","Адвокат","Фермер","Архитектор","Принц","Мясник","Скотовод","Робототехник","Каскадер","Астроном","Ученый","Стендапер","Репер","Певец","Ясновидец","Скульптор","Экскурсовод","Капитан корабля","Водолаз","Боксер","Футболист","Баскетболист","Волейболист","Пловец","Балерина","Циркач","Теннисист","Хоккеист","Пианист","Скрипач","Гитарист","Саксофонист","Бизнесмен","Поэт","Снайпер","Генерал","Бармен","Дозорный","Отшельник","Шаман","Охотник за сокровищами","Смотритель маяка","Шахтер","Винокур","Почтальон","Мастер йоги","Пчеловод","Пивовар","Критик","Граф","Трейдер","Альпинист","Строитель","Разведчик","Хакер"]

var featureArr = ["Обожает животных","Любит выпить","Бегает по утрам","Всегда опаздывает","Курит","Любит медитировать","Обожает чай","Обожает кофе","Зануда","Молчалив(-ва)","Сова","Жаворонок","Часто врёт","Хромает","Сутулится","Барахольщик(-ца)","Помогает бездомным","Жертвует в приюты","Боится животных","Сильно потеет","Носит только чёрное","Носит яркую одежду","Носит только белое","Носит странную одежду","Лишний вес","Нездоровая худоба","Высокий рост","Низкий рост","Длинные волосы","Короткие волосы","Шрам на лице","Ходит с тростью","Странная причёска","Носит очки","Необычный цвет глаз","Отлично танцует","Прыщи","Веснушки","Всё время слушает музыку","Большие глаза","Маленькие глаза","Родимое пятно","Лысый(-ая)","Сопит","Храпит","Богат(-ая)","Нищий(-ая)","Всё время торопится","Никогда не спешит"]

const generateBtn = document.querySelector(".generate")

const type = document.querySelector(".type")
const gender = document.querySelector(".gender")
const age = document.querySelector(".age")
const temper = document.querySelector(".temper")
const profession = document.querySelector(".profession")
const feature = document.querySelector(".feature")

function randomElement (name, array) {
	let currentItem = Math.floor(Math.random() * array.length);
	name = `.${name.className}-body`

	const nameHtml = document.querySelector(name)
	nameHtml.innerHTML = array[currentItem]
}

generateBtn.addEventListener("click", () => {
	randomElement(type, typeArr)
	randomElement(gender, genderArr)
	randomElement(age, ageArr)
	randomElement(temper, temperArr)
	randomElement(profession, professionArr)
	randomElement(feature, featureArr)
})


